app/controllers/ideas_controller.rb

INSERT INTO "ideas" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Key Lime Pie-2"], ["description", "improves airflow to lungs"], ["created_at", "2020-12-05 03:16:15.598000"], ["updated_at", "2020-12-05 03:16:15.598000"], ["user_id", 29]]
---
  def create
    @idea=Idea.new idea_params
    @idea.user = current_user
    if @idea.save